; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v5 ?v6)
             (pred_1 ?v1 ?v2)
             (pred_4 ?v5 ?v2)
             (pred_12 ?v10 ?v5 )
	     (pred_7 ?v5)
             (pred_8 ?v11)
             (pred_9 ?v1)
             (pred_11 ?v2)
             (pred_10 ?v5)
             (pred_2 ?v1)
             (pred_6 ?v5)
             (pred_5 ))



(:action op_5
:parameters (?v3 ?v7 ?v9 ?v13)
:precondition (and (pred_8 ?v3) (pred_8 ?v7) (pred_9 ?v9) (pred_11 ?v13)
          (pred_3 ?v3 ?v7) (pred_1 ?v9 ?v13)
                   (pred_4 ?v7 ?v13) (pred_7 ?v3) 
                   (pred_10 ?v7) (pred_2 ?v9))
:effect (and  (pred_6 ?v7) (not (pred_10 ?v7))))


(:action op_4
:parameters (?v3 ?v12)
:precondition (and (pred_8 ?v3) (pred_8 ?v12)
               (pred_7 ?v3) (pred_3 ?v3 ?v12) (pred_6 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v3))))

(:action op_2
:parameters (?v3 ?v9)
:precondition (and (pred_8 ?v3) (pred_9 ?v9) 
                  (pred_7 ?v3) (pred_12 ?v9 ?v3) (pred_5 ))
:effect (and (pred_2 ?v9)
   (not (pred_12 ?v9 ?v3)) (not (pred_5 ))))


(:action op_3
:parameters (?v3 ?v8 ?v4)
:precondition (and (pred_8 ?v3) (pred_9 ?v8) (pred_9 ?v4)
                  (pred_7 ?v3) (pred_2 ?v4) (pred_12 ?v8 ?v3))
:effect (and (pred_2 ?v8) (pred_12 ?v4 ?v3)
        (not (pred_2 ?v4)) (not (pred_12 ?v8 ?v3))))

(:action op_1
:parameters (?v3 ?v9)
:precondition (and (pred_8 ?v3) (pred_9 ?v9) 
                  (pred_7 ?v3) (pred_2 ?v9))
:effect (and (pred_5 ) (pred_12 ?v9 ?v3) (not (pred_2 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_15 obj_06 obj_13 obj_12 obj_14 obj_29 obj_17 obj_21 obj_04 obj_28 obj_20 obj_24 obj_16 obj_25 obj_19 obj_09 obj_18 obj_01 obj_26 obj_08 obj_11 obj_30 obj_02 obj_23
    obj_27 obj_10
    obj_22 obj_07 obj_03
    )

    (:init
       (pred_5)

       (pred_8 obj_05)
       (pred_8 obj_15)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_12)
       (pred_8 obj_14)
       (pred_8 obj_29)
       (pred_8 obj_17)
       (pred_8 obj_21)
       (pred_8 obj_04)
       (pred_8 obj_28)
       (pred_8 obj_20)
       (pred_8 obj_24)
       (pred_8 obj_16)
       (pred_8 obj_25)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_8 obj_18)
       (pred_8 obj_01)
       (pred_8 obj_26)
       (pred_8 obj_08)
       (pred_8 obj_11)
       (pred_8 obj_30)
       (pred_8 obj_02)
       (pred_8 obj_23)
       (pred_11 obj_27)
       (pred_11 obj_10)
       (pred_9 obj_22)
       (pred_9 obj_07)
       (pred_9 obj_03)

       (pred_3 obj_05 obj_14)
       (pred_3 obj_05 obj_15)
       (pred_3 obj_15 obj_29)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_15 obj_05)
       (pred_3 obj_06 obj_17)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_13 obj_21)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_14 obj_29)
       (pred_3 obj_14 obj_05)
       (pred_3 obj_29 obj_20)
       (pred_3 obj_29 obj_17)
       (pred_3 obj_29 obj_15)
       (pred_3 obj_29 obj_14)
       (pred_3 obj_17 obj_24)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_17 obj_06)
       (pred_3 obj_17 obj_29)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_21 obj_04)
       (pred_3 obj_21 obj_13)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_04 obj_25)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_04 obj_21)
       (pred_3 obj_28 obj_19)
       (pred_3 obj_28 obj_20)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_20 obj_24)
       (pred_3 obj_20 obj_29)
       (pred_3 obj_20 obj_28)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_24 obj_16)
       (pred_3 obj_24 obj_17)
       (pred_3 obj_24 obj_20)
       (pred_3 obj_16 obj_01)
       (pred_3 obj_16 obj_25)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_16 obj_24)
       (pred_3 obj_25 obj_26)
       (pred_3 obj_25 obj_04)
       (pred_3 obj_25 obj_16)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_19 obj_09)
       (pred_3 obj_19 obj_28)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_09 obj_20)
       (pred_3 obj_09 obj_19)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_18 obj_01)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_26)
       (pred_3 obj_01 obj_16)
       (pred_3 obj_01 obj_18)
       (pred_3 obj_26 obj_23)
       (pred_3 obj_26 obj_25)
       (pred_3 obj_26 obj_01)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_19)
       (pred_3 obj_11 obj_30)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_30 obj_02)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_30 obj_11)
       (pred_3 obj_02 obj_23)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_30)
       (pred_3 obj_23 obj_26)
       (pred_3 obj_23 obj_02)
       (pred_10 obj_23)
       (pred_10 obj_28)
       (pred_10 obj_19)
       (pred_4  obj_23 obj_27)
       (pred_4  obj_28 obj_10)
       (pred_4  obj_19 obj_27)
       (pred_6 obj_05)
       (pred_6 obj_15)
       (pred_6 obj_06)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_14)
       (pred_6 obj_29)
       (pred_6 obj_17)
       (pred_6 obj_21)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_24)
       (pred_6 obj_16)
       (pred_6 obj_25)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_01)
       (pred_6 obj_26)
       (pred_6 obj_08)
       (pred_6 obj_11)
       (pred_6 obj_30)
       (pred_6 obj_02)

       (pred_1  obj_22 obj_27)
       (pred_1  obj_07 obj_10)
       (pred_1  obj_03 obj_27)
       (pred_12 obj_22 obj_12)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_03 obj_06)
       (pred_7 obj_14)
    )

    (:goal (and
       (pred_12 obj_03 obj_25)
    ))
(:constraints
  (always (not (pred_7 obj_17)))
)
)

; plan
1. (op_4 obj_14 obj_29)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_29)
   goals met: 0 of 1
2. (op_4 obj_29 obj_15)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_15)
   goals met: 0 of 1
3. (op_4 obj_15 obj_06)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_06)
   goals met: 0 of 1
4. (op_2 obj_06 obj_03)
   deleted: (pred_12 obj_03 obj_06) (pred_5)
   added: (pred_2 obj_03)
   goals met: 0 of 1
5. (op_4 obj_06 obj_13)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_13)
   goals met: 0 of 1
6. (op_4 obj_13 obj_12)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_12)
   goals met: 0 of 1
7. (op_4 obj_12 obj_04)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_04)
   goals met: 0 of 1
8. (op_4 obj_04 obj_25)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_25)
   goals met: 0 of 1
9. (op_1 obj_25 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_5) (pred_12 obj_03 obj_25)
   goals met: 1 of 1
